export const bn_errors:Record<string, any> = {
    "404": {
        "title": "ত্রুটি | ৪০৪"
    },
    "error": "ত্রুটি",
    "server_wrong": "সার্ভারে কিছু ভুল হয়েছে, বিস্তারিত জানতে লগ দেখুন।",
    "server_not_found": "সার্ভার পাওয়া যায়নি।",
    "inflate_error": "আপনার ইনপুটে কিছু ত্রুটি আছে, অনুগ্রহ করে যাচাই করুন।",
    "action_error": "কাজটি সফল হয়নি, আগে ত্রুটিগুলো ঠিক করুন।",
    "no_history": "কোনো ইতিহাস পাওয়া যায়নি।",
    "no_record": "কোনো রেকর্ড পাওয়া যায়নি।",
    "click_add_new": "নতুন যোগ করতে \"Add New\" বাটনে ক্লিক করুন।",
    "no_change": "আপনি কোনো পরিবর্তন করেননি।",
    "no_access_content": "আপনার এই কনটেন্টে প্রবেশের অনুমতি নেই।",
    "login_incorrect": "প্রদত্ত তথ্য সঠিক নয়।",
    "incorrect": "ভুল :type, আবার চেষ্টা করুন",
    "not_reg": ":type আমাদের সিস্টেমে নিবন্ধিত নয়, আবার চেষ্টা করুন",
    "not_found": ":attribute পাওয়া যায়নি",
    "no_data_selected": "কোনো ডাটা নির্বাচন করা হয়নি",
    "no_internet": "ইন্টারনেট সংযোগ নেই",
    "no_verify": "ইমেইল যাচাই করা হয়নি, অনুগ্রহ করে যাচাই করুন!",
    "no_password": "ব্যবহারকারীর তথ্য পাওয়া যায়নি? অনুগ্রহ করে আপনার তথ্য পরিবর্তন করুন!"
};
