export const bn_validation:Record<string, any> = {
    "accepted": "অবশ্যই গ্রহণ করতে হবে।",
    "active_url": "একটি বৈধ URL নয়।",
    "after": ":date এর পরের একটি তারিখ হতে হবে।",
    "after_or_equal": ":date এর পর বা সমান একটি তারিখ হতে হবে।",
    "alpha": "শুধুমাত্র অক্ষর থাকতে পারে।",
    "alpha_dash": "শুধুমাত্র অক্ষর, সংখ্যা, ড্যাশ ও আন্ডারস্কোর থাকতে পারে।",
    "alpha_num": "শুধুমাত্র অক্ষর ও সংখ্যা থাকতে পারে।",
    "array": "একটি অ্যারে হতে হবে।",
    "before": ":date এর পূর্বের একটি তারিখ হতে হবে।",
    "before_or_equal": ":date এর পূর্ব বা সমান একটি তারিখ হতে হবে।",
    "between": {
        "numeric": ":min এবং :max এর মধ্যে হতে হবে।",
        "file": ":min থেকে :max কিলোবাইটের মধ্যে হতে হবে।",
        "string": ":min থেকে :max অক্ষরের মধ্যে হতে হবে।",
        "array": ":min থেকে :max আইটেম থাকতে হবে।"
    },
    "boolean": "ক্ষেত্রটি অবশ্যই true অথবা false হতে হবে।",
    "confirmed": "নিশ্চিতকরণ মেলে না।",
    "date": "বৈধ তারিখ নয়।",
    "date_equals": ":date এর সমান একটি তারিখ হতে হবে।",
    "date_format": ":format ফরম্যাটের সাথে মিল নেই।",
    "different": "ভিন্ন হতে হবে।",
    "digits": ":digits অঙ্ক হতে হবে।",
    "digits_between": ":min থেকে :max অঙ্কের মধ্যে হতে হবে।",
    "dimensions": ":attribute এর ছবির মাত্রা অবৈধ।",
    "distinct": "ক্ষেত্রের মান পুনরাবৃত্ত।",
    "email": "বৈধ ইমেইল হতে হবে।",
    "email_or_number": "একটি বৈধ মোবাইল নম্বর বা ইমেইল হতে হবে।",
    "ends_with": "নিম্নলিখিতগুলোর মধ্যে একটির দ্বারা শেষ হতে হবে: :values।",
    "exists": "অবৈধ।",
    "file": "একটি ফাইল হতে হবে।",
    "filled": "ক্ষেত্রের একটি মান থাকতে হবে।",
    "gt": {
        "numeric": ":value থেকে বড় হতে হবে।",
        "file": ":value কিলোবাইট থেকে বড় হতে হবে।",
        "string": ":value অক্ষরের চেয়ে বড় হতে হবে।",
        "array": ":value এর বেশি আইটেম থাকতে হবে।"
    },
    "gte": {
        "numeric": ":value এর সমান বা বড় হতে হবে।",
        "file": ":value কিলোবাইটের সমান বা বড় হতে হবে।",
        "string": ":value অক্ষরের সমান বা বড় হতে হবে।",
        "array": ":value বা তার বেশি আইটেম থাকতে হবে।"
    },
    "image": "একটি ছবি হতে হবে।",
    "in": "অবৈধ।",
    "in_array": ":other এর মধ্যে ক্ষেত্রটি পাওয়া যায়নি।",
    "integer": "একটি পূর্ণসংখ্যা হতে হবে।",
    "ip": "বৈধ আইপি ঠিকানা হতে হবে।",
    "ipv4": "বৈধ IPv4 ঠিকানা হতে হবে।",
    "ipv6": "বৈধ IPv6 ঠিকানা হতে হবে।",
    "json": "বৈধ JSON স্ট্রিং হতে হবে।",
    "lt": {
        "numeric": ":value এর কম হতে হবে।",
        "file": ":value কিলোবাইটের কম হতে হবে।",
        "string": ":value অক্ষরের কম হতে হবে।",
        "array": ":value এর কম আইটেম থাকতে হবে।"
    },
    "lte": {
        "numeric": ":value এর সমান বা কম হতে হবে।",
        "file": ":value কিলোবাইটের সমান বা কম হতে হবে।",
        "string": ":value অক্ষরের সমান বা কম হতে হবে।",
        "array": ":value এর বেশি আইটেম থাকা যাবে না।"
    },
    "max": {
        "numeric": ":max এর চেয়ে বড় নয়।",
        "file": ":max কিলোবাইটের চেয়ে বড় নয়।",
        "string": ":max অক্ষরের চেয়ে বড় নয়।",
        "array": ":max এর বেশি আইটেম থাকা যাবে না।"
    },
    "maxlength": ":digits অক্ষরের চেয়ে বড় হতে পারবে না।",
    "minlength": ":digits অক্ষরের চেয়ে ছোট হতে পারবে না।",
    "mimes": ":values ধরনের একটি ফাইল হতে হবে।",
    "mimetypes": ":values ধরনের একটি ফাইল হতে হবে।",
    "min": {
        "numeric": "কমপক্ষে :min হতে হবে।",
        "file": "কমপক্ষে :min কিলোবাইট হতে হবে।",
        "string": "কমপক্ষে :min অক্ষর হতে হবে।",
        "array": "কমপক্ষে :min আইটেম থাকতে হবে।"
    },
    "not_in": "অবৈধ।",
    "not_regex": "ফরম্যাট অবৈধ।",
    "numeric": "একটি সংখ্যা হতে হবে।",
    "password": "পাসওয়ার্ডটি সঠিক নয়।",
    "present": "ক্ষেত্রটি অবশ্যই উপস্থিত থাকতে হবে।",
    "regex": "এই ফরম্যাট অবৈধ।",
    "required": "এই ক্ষেত্রটি আবশ্যক।",
    "required_if": ":other যখন :value থাকে তখন ক্ষেত্রটি আবশ্যক।",
    "required_unless": ":other :values এর মধ্যে না থাকলে ক্ষেত্রটি আবশ্যক।",
    "required_with": ":values উপস্থিত থাকলে ক্ষেত্রটি আবশ্যক।",
    "required_with_all": ":values উপস্থিত থাকলে ক্ষেত্রটি আবশ্যক।",
    "required_without": ":values উপস্থিত না থাকলে ক্ষেত্রটি আবশ্যক।",
    "required_without_all": ":values গুলোর কোনোটিই উপস্থিত না থাকলে ক্ষেত্রটি আবশ্যক।",
    "same": "মেলাতে হবে।",
    "size": {
        "numeric": ":size হতে হবে।",
        "file": ":size কিলোবাইট হতে হবে।",
        "string": ":size অক্ষর হতে হবে।",
        "array": ":size আইটেম থাকতে হবে।"
    },
    "starts_with": "নিম্নলিখিতগুলোর মধ্যে একটির দ্বারা শুরু হতে হবে: :values।",
    "string": "একটি স্ট্রিং হতে হবে।",
    "timezone": "বৈধ একটি অঞ্চল হতে হবে।",
    "unique": ":attribute ইতিমধ্যে নেওয়া হয়েছে।",
    "uploaded": "আপলোড করতে ব্যর্থ হয়েছে।",
    "url": "ফরম্যাট অবৈধ।",
    "uuid": "বৈধ একটি UUID হতে হবে।",
    "custom": {
        "attribute-name": {
            "rule-name": "custom-message"
        }
    },
    "attributes": {}
};
